# Rebar Container Append Item From Curves And Shape Method

Source: https://www.revitapidocs.com/2026/5294588f-d729-ddfd-1903-35eb12e8e1fd.htm

---

| Rebar Container Append Item From Curves And Shape Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | AppendItemFromCurvesAndShape(RebarShape, RebarBarType, RebarHookType, RebarHookType, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation) | **Obsolete.** |
|  | AppendItemFromCurvesAndShape(RebarShape, RebarBarType, RebarHookType, RebarHookType, XYZ, IList Curve , RebarTerminationOrientation, RebarTerminationOrientation) |  |

Top See Also

#### Reference

RebarContainer Class Autodesk.Revit.DB.Structure Namespace